[{"title":"Nanofertilizers and nanopesticides for agriculture","user":"MD. Shalim Sadman","text":"The excess use of mineral fertilizers and unsafe pesticides has led to pollution and serious health issues. Nanoscience may solve those issues by providing nanomaterials of higher performance. Here we reviewed the development of nanofertilizers and nanopesticides and their applications on crop systems. Nanofertilizers such as N, P, K, Fe, Mn, Zn, Cu, Mo and carbon nanotubes show better release and targeted delivery efficiency. Nanopesticides such as Ag, Cu, SiO2, ZnO and nanoformulations show better broad-spectrum pest protection efficiency in comparison with conventional pesticides."},{"title":"Agriculture and the environment","user":"MD. Shalim Sadman","text":"The distinctive nature of environmental quality problems in agriculture — an industry based on the extraction of highly variable natural resources under stochastic conditions — has important implications for policy design. First, we examine the source of environmental quality problems and the strength of incentives for resource stewardship that may incidentally induce farmers to protect environmental quality. In turn, we examine environmental policy design under two features that are pervasive in agriculture: (1) heterogeneity caused by resource variability and (2) uncertainty. Next, we examine the effects of interactions between agricultural, environmental, and resource policies. Finally, we review important areas for further research."},{"title":"Technology: The Future of Agriculture","user":"MD. Shalim Sadman","text":"Over the centuries, as farmers have adopted more technology in their pursuit of greater yields, the belief that 'bigger is better' has come to dominate farming, rendering small-scale operations impractical. But advances in robotics and sensing technologies are threatening to disrupt today's agribusiness model. “There is the potential for intelligent robots to change the economic model of farming so that it becomes feasible to be a small producer again,” says robotics engineer George Kantor at Carnegie Mellon University in Pittsburgh, Pennsylvania."}]